; domain
(define (domain aviones)
(:requirements :strips)
(:predicates
	(en ?a ?b) 
	(avion ?a)
	(carga ?c)
	(aeropuerto ?a)
) 
(:action cargar
 :parameters ( ?c ?a ?ap)
 :precondition
	(and (en ?c ?ap) (en ?a ?ap) (carga ?c) (avion ?a) (aeropuerto ?ap))
 :effect
	(and 
		(en ?c ?a) 
		(not (en ?c ?ap))
	)
)
(:action descargar
 :parameters ( ?c ?a ?ap)
 :precondition
	(and (en ?c ?a) (en ?a ?ap) (carga ?c) (avion ?a) (aeropuerto ?ap))
 :effect
	(and 
		(en ?c ?ap) 
		(not (en ?c ?a))
	)
)
(:action volar
 :parameters ( ?a ?origen ?destino)
 :precondition
	(and (en ?a ?origen) (avion ?a) (aeropuerto ?origen) (aeropuerto ?destino))
 :effect
	(and 
		(en ?a ?destino) 
		(not (en ?a ?origen))
	)
)
)

; problem
(define (problem carga-aerea)
    (:domain aviones)
    (:objects 
        LA01
        LA02
        LA03
        AA01
        AA02
        AA03
        FB01
        FB02
        FB03
        MDZ
        AEP
        COR
        SFN
        FERTILIZANTE
        TELA-GRANIZO
        COSECHADORA
        AUTOPARTES
    )
    (:init 
        (avion LA01)
        (avion LA02)
        (avion LA03)
        (avion AA01)
        (avion AA02)
        (avion AA03)
        (avion FB01)
        (avion FB02)
        (avion FB03)
        (aeropuerto MDZ)
        (aeropuerto AEP)
        (aeropuerto COR)
        (aeropuerto SFN)
        (carga FERTILIZANTE)
        (carga TELA-GRANIZO)
        (carga COSECHADORA)
        (carga AUTOPARTES)
        (en LA01 MDZ)
        (en LA02 AEP)
        (en LA03 COR)
        (en AA01 SFN)
        (en AA02 MDZ)
        (en AA03 AEP)
        (en FB01 COR)
        (en FB02 AEP)
        (en FB03 SFN)
        (en FERTILIZANTE AEP)
        (en TELA-GRANIZO SFN)
        (en COSECHADORA MDZ)
        (en AUTOPARTES COR)
    )
    (:goal 
        (and
            (en FERTILIZANTE SFN); MDZ
            (en TELA-GRANIZO MDZ); COR
            (en COSECHADORA COR); AEP
            (en AUTOPARTES AEP); SFN
        )
    )
)

; plan
1. (cargar autopartes la03 cor)
   deleted: (en autopartes cor)
   added: (en autopartes la03)
   goals met: 0 of 4
2. (volar la03 cor aep)
   deleted: (en la03 cor)
   added: (en la03 aep)
   goals met: 0 of 4
3. (cargar fertilizante la03 aep)
   deleted: (en fertilizante aep)
   added: (en fertilizante la03)
   goals met: 0 of 4
4. (descargar autopartes la03 aep)
   deleted: (en autopartes la03)
   added: (en autopartes aep)
   goals met: 1 of 4
5. (volar la03 aep sfn)
   deleted: (en la03 aep)
   added: (en la03 sfn)
   goals met: 1 of 4
6. (cargar tela-granizo la03 sfn)
   deleted: (en tela-granizo sfn)
   added: (en tela-granizo la03)
   goals met: 1 of 4
7. (descargar fertilizante la03 sfn)
   deleted: (en fertilizante la03)
   added: (en fertilizante sfn)
   goals met: 2 of 4
8. (volar la03 sfn mdz)
   deleted: (en la03 sfn)
   added: (en la03 mdz)
   goals met: 2 of 4
9. (descargar tela-granizo la03 mdz)
   deleted: (en tela-granizo la03)
   added: (en tela-granizo mdz)
   goals met: 3 of 4
10. (cargar cosechadora la03 mdz)
   deleted: (en cosechadora mdz)
   added: (en cosechadora la03)
   goals met: 3 of 4
11. (volar la03 mdz cor)
   deleted: (en la03 mdz)
   added: (en la03 cor)
   goals met: 3 of 4
12. (descargar cosechadora la03 cor)
   deleted: (en cosechadora la03)
   added: (en cosechadora cor)
   goals met: 4 of 4
